BellerageHackathon/src/InformationRegisters/ОбработанныеВходящиеСообщения/ОбработанныеВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбработанныеВходящиеСообщения</name>
  <resources>
    <name>ХэшСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПопытки</name>
    <type>
      <types>DocumentRef.РезультатПопытки</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BellerageHackathon/src/InformationRegisters/ИдентификаторыИнтеграции/ИдентификаторыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИдентификаторыИнтеграции</name>
  <resources>
    <name>Объект1С</name>
    <type>
      <types>CatalogRef.Тесты</types>
      <types>CatalogRef.ВерсииТестов</types>
      <types>CatalogRef.ВопросыВерсийТестов</types>
      <types>CatalogRef.ВариантыОтветовВерсий</types>
      <types>CatalogRef.КандидатыВнешние</types>
      <types>CatalogRef.СообщенияОбмена</types>
      <types>DocumentRef.ПубликацияТеста</types>
      <types>DocumentRef.РезультатПопытки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСущности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BellerageHackathon/src/InformationRegisters/СостояниеСинхронизацииВерсий/СостояниеСинхронизацииВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСинхронизацииВерсий</name>
  <resources>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ХэшСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообщенийОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BellerageHackathon/src/Enums/НаправленияОбмена/НаправленияОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияОбмена</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыСообщенийОбмена/СтатусыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщенийОбмена</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПовтора</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Подтверждено</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>НеобрабатываемаяОшибка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/ТипыСообщенийОбмена/ТипыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийОбмена</name>
  <enumValues>
    <name>ПубликацияВерсииТеста</name>
  </enumValues>
  <enumValues>
    <name>АрхивацияТеста</name>
  </enumValues>
  <enumValues>
    <name>РезультатПопытки</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>РезультатРучнойПроверки</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СпособыЗавершенияПопытки/СпособыЗавершенияПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗавершенияПопытки</name>
  <enumValues>
    <name>Кандидатом</name>
  </enumValues>
  <enumValues>
    <name>ПоИстеченииВремени</name>
  </enumValues>
  <enumValues>
    <name>Системой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыПроверкиОтвета/СтатусыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиОтвета</name>
  <enumValues>
    <name>НеПроверен</name>
  </enumValues>
  <enumValues>
    <name>Правильный</name>
  </enumValues>
  <enumValues>
    <name>Неправильный</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРучнойПроверки</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Documents/РезультатПопытки/РезультатПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатПопытки</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПопытки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РевизияРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНазначения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.КандидатыВнешние</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКандидатаСнимок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшВерсииТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗавершения</name>
    <type>
      <types>EnumRef.СпособыЗавершенияПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>EnumRef.СтатусыПроверкиПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПрохождения</name>
    <type>
      <types>EnumRef.РезультатыПрохождения</types>
    </type>
  </attributes>
  <attributes>
    <name>НабраноБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПравильныхОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллСнимок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшИсходногоСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеСообщение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВопросВерсии</name>
      <type>
        <types>CatalogRef.ВопросыВерсийТестов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопросаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветаСнимок</name>
      <type>
        <types>EnumRef.ТипыОтветов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветДан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПроверки</name>
      <type>
        <types>EnumRef.СтатусыПроверкиОтвета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПравильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НабраноБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаВерсии</name>
      <type>
        <types>CatalogRef.ВариантыОтветовВерсий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторВерсииВарианта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВариантаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BellerageHackathon/src/CommonModules/ИнтеграцияСЭлементомСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Перем КэшТокенаДоступаЭлемента;
Перем ДействуетДоКэшТокенаЭлемента;

Функция СоздатьИсходящееСообщение(
	ТипСообщения,
	ИдентификаторСущности,
	ПолезнаяНагрузка,
	ХэшПолезнойНагрузки,
	ИдентификаторКорреляции = Неопределено,
	ВерсияКонтракта = "1.0") Экспорт

	Если Не ЗначениеЗаполнено(ТипСообщения) Тогда
		ВызватьИсключение "Не указан тип исходящего сообщения.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторСущности) Тогда
		ВызватьИсключение "Не указан идентификатор сущности.";
	КонецЕсли;

	Если ПустаяСтрока(ХэшПолезнойНагрузки) Тогда
		ВызватьИсключение "Не указан хэш полезной нагрузки.";
	КонецЕсли;

	ИдентификаторСообщения = Новый УникальныйИдентификатор;
	Если ИдентификаторКорреляции = Неопределено Тогда
		ИдентификаторКорреляции = ИдентификаторСообщения;
	КонецЕсли;

	Сообщение = Справочники.СообщенияОбмена.СоздатьЭлемент();
	Сообщение.Наименование = СтрШаблон("%1, %2", ТипСообщения, ИдентификаторСообщения);
	Сообщение.ИдентификаторСообщения = ИдентификаторСообщения;
	Сообщение.Направление = Перечисления.НаправленияОбмена.Исходящее;
	Сообщение.ТипСообщения = ТипСообщения;
	Сообщение.Статус = Перечисления.СтатусыСообщенийОбмена.Новое;
	Сообщение.ИдентификаторКорреляции = ИдентификаторКорреляции;
	Сообщение.ИдентификаторСущности = ИдентификаторСущности;
	Сообщение.ВерсияКонтракта = ВерсияКонтракта;
	Сообщение.ДатаСоздания = ТекущаяДатаСеанса();
	Сообщение.ДатаСледующейПопытки = ТекущаяДатаСеанса();
	Сообщение.КоличествоПопыток = 0;
	Сообщение.ХэшПолезнойНагрузки = ХэшПолезнойНагрузки;
	Сообщение.ПолезнаяНагрузка = Новый ХранилищеЗначения(ПолезнаяНагрузка);
	Сообщение.Записать();

	Возврат Сообщение.Ссылка;

КонецФункции

Функция ПроверитьПовторноеВходящееСообщение(
	ИдентификаторСообщения,
	ХэшСообщения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Обработанные.ХэшСообщения КАК ХэшСообщения,
	|	Обработанные.РезультатПопытки КАК РезультатПопытки
	|ИЗ
	|	РегистрСведений.ОбработанныеВходящиеСообщения КАК Обработанные
	|ГДЕ
	|	Обработанные.ИдентификаторСообщения = &ИдентификаторСообщения";

	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Выборка = Запрос.Выполнить().Выбрать();

	Результат = Новый Структура(
		"Найдено, СовпадаетХэш, РезультатПопытки",
		Ложь,
		Ложь,
		Документы.РезультатПопытки.ПустаяСсылка());

	Если Выборка.Следующий() Тогда
		Результат.Найдено = Истина;
		Результат.СовпадаетХэш = Выборка.ХэшСообщения = ХэшСообщения;
		Результат.РезультатПопытки = Выборка.РезультатПопытки;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ЗафиксироватьОбработанноеВходящееСообщение(
	ИдентификаторСообщения,
	ХэшСообщения,
	ТипСообщения,
	РезультатПопытки = Неопределено) Экспорт

	Повтор = ПроверитьПовторноеВходящееСообщение(
		ИдентификаторСообщения,
		ХэшСообщения);

	Если Повтор.Найдено Тогда
		Если Не Повтор.СовпадаетХэш Тогда
			ВызватьИсключение "Коллизия messageId: сообщение уже обработано с другим хэшем.";
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ЗафиксироватьОбработанноеВходящееСообщениеБезПроверки(
		ИдентификаторСообщения,
		ХэшСообщения,
		ТипСообщения,
		РезультатПопытки);

КонецПроцедуры

Процедура ЗафиксироватьОбработанноеВходящееСообщениеБезПроверки(
	ИдентификаторСообщения,
	ХэшСообщения,
	ТипСообщения,
	РезультатПопытки = Неопределено)

	Если РезультатПопытки = Неопределено Тогда
		РезультатПопытки = Документы.РезультатПопытки.ПустаяСсылка();
	КонецЕсли;

	Запись = РегистрыСведений.ОбработанныеВходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ХэшСообщения = ХэшСообщения;
	Запись.ТипСообщения = ТипСообщения;
	Запись.ДатаОбработки = ТекущаяДатаСеанса();
	Запись.РезультатПопытки = РезультатПопытки;
	Запись.Записать();

КонецПроцедуры

Процедура ЗарегистрироватьИдентификаторИнтеграции(
	ВидСущности,
	Идентификатор,
	Объект1С) Экспорт

	Если ПустаяСтрока(СокрЛП(ВидСущности)) Тогда
		ВызватьИсключение "Не указан вид интеграционной сущности.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Идентификатор)
		Или Не ЗначениеЗаполнено(Объект1С) Тогда
		ВызватьИсключение "Не заполнено соответствие интеграционных идентификаторов.";
	КонецЕсли;

	Запись = РегистрыСведений.ИдентификаторыИнтеграции.СоздатьМенеджерЗаписи();
	Запись.ВидСущности = ВидСущности;
	Запись.Идентификатор = Идентификатор;
	Запись.Объект1С = Объект1С;
	Запись.ДатаРегистрации = ТекущаяДатаСеанса();
	Запись.Записать();

КонецПроцедуры

Функция НайтиОбъект1С(ВидСущности, Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Идентификаторы.Объект1С КАК Объект1С
	|ИЗ
	|	РегистрСведений.ИдентификаторыИнтеграции КАК Идентификаторы
	|ГДЕ
	|	Идентификаторы.ВидСущности = &ВидСущности
	|	И Идентификаторы.Идентификатор = &Идентификатор";

	Запрос.УстановитьПараметр("ВидСущности", ВидСущности);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект1С;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура ОбновитьСостояниеСинхронизацииВерсии(
	ВерсияТеста,
	ИдентификаторСообщения,
	ХэшСодержимого,
	Статус,
	КоличествоПопыток = 0,
	ТекстОшибки = "") Экспорт

	Запись = РегистрыСведений.СостояниеСинхронизацииВерсий.СоздатьМенеджерЗаписи();
	Запись.ВерсияТеста = ВерсияТеста;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ХэшСодержимого = ХэшСодержимого;
	Запись.Статус = Статус;
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.КоличествоПопыток = КоличествоПопыток;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.Записать();

КонецПроцедуры

Функция ПолучитьСообщенияКОтправке(ДатаДо, МаксимальноеКоличество = 100) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ &МаксимальноеКоличество
	|	Сообщения.Ссылка КАК Сообщение
	|ИЗ
	|	Справочник.СообщенияОбмена КАК Сообщения
	|ГДЕ
	|	Сообщения.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияОбмена.Исходящее)
	|	И Сообщения.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыСообщенийОбмена.Новое),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыСообщенийОбмена.ОжидаетПовтора))
	|	И Сообщения.ДатаСледующейПопытки <= &ДатаДо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сообщения.ДатаСледующейПопытки,
	|	Сообщения.ДатаСоздания";

	Запрос.УстановитьПараметр("МаксимальноеКоличество", МаксимальноеКоличество);
	Запрос.УстановитьПараметр("ДатаДо", ДатаДо);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Сообщение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция НайтиСообщениеОбмена(ИдентификаторСообщения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сообщения.Ссылка КАК Сообщение,
	|	Сообщения.ХэшПолезнойНагрузки КАК ХэшПолезнойНагрузки,
	|	Сообщения.Статус КАК Статус
	|ИЗ
	|	Справочник.СообщенияОбмена КАК Сообщения
	|ГДЕ
	|	Сообщения.ИдентификаторСообщения = &ИдентификаторСообщения";

	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Выборка = Запрос.Выполнить().Выбрать();

	Результат = Новый Структура(
		"Найдено, Сообщение, ХэшПолезнойНагрузки, Статус",
		Ложь,
		Справочники.СообщенияОбмена.ПустаяСсылка(),
		"",
		Перечисления.СтатусыСообщенийОбмена.Новое);

	Если Выборка.Следующий() Тогда
		Результат.Найдено = Истина;
		Результат.Сообщение = Выборка.Сообщение;
		Результат.ХэшПолезнойНагрузки = Выборка.ХэшПолезнойНагрузки;
		Результат.Статус = Выборка.Статус;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция СоздатьВходящееСообщение(
	ИдентификаторСообщения,
	ТипСообщения,
	ИдентификаторСущности,
	ПолезнаяНагрузка,
	ХэшПолезнойНагрузки,
	ВерсияКонтракта = "1.0") Экспорт

	НайденноеСообщение = НайтиСообщениеОбмена(ИдентификаторСообщения);
	Если НайденноеСообщение.Найдено Тогда
		Если НайденноеСообщение.ХэшПолезнойНагрузки <> ХэшПолезнойНагрузки Тогда
			ВызватьИсключение "Коллизия messageId: в очереди уже есть сообщение с другим хэшем.";
		КонецЕсли;
		Возврат НайденноеСообщение.Сообщение;
	КонецЕсли;

	Сообщение = Справочники.СообщенияОбмена.СоздатьЭлемент();
	Сообщение.ИдентификаторСообщения = ИдентификаторСообщения;
	Сообщение.Наименование = СтрШаблон("%1, %2", ТипСообщения, ИдентификаторСообщения);
	Сообщение.Направление = Перечисления.НаправленияОбмена.Входящее;
	Сообщение.ТипСообщения = ТипСообщения;
	Сообщение.Статус = Перечисления.СтатусыСообщенийОбмена.Новое;
	Сообщение.ИдентификаторКорреляции = ИдентификаторСообщения;
	Сообщение.ИдентификаторСущности = ИдентификаторСущности;
	Сообщение.ВерсияКонтракта = ВерсияКонтракта;
	Сообщение.ДатаСоздания = ТекущаяДатаСеанса();
	Сообщение.ДатаСледующейПопытки = ТекущаяДатаСеанса();
	Сообщение.ХэшПолезнойНагрузки = ХэшПолезнойНагрузки;
	Сообщение.ПолезнаяНагрузка = Новый ХранилищеЗначения(ПолезнаяНагрузка);
	Сообщение.Записать();

	Возврат Сообщение.Ссылка;

КонецФункции

Функция ПолучитьНастройкиОбмена() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("Хост", Константы.ХостAPIЭлемента.Получить());
	Настройки.Вставить("Порт", Константы.ПортAPIЭлемента.Получить());
	Настройки.Вставить("ИспользоватьHTTPS", Константы.ИспользоватьHTTPSЭлемента.Получить());
	Настройки.Вставить("БазовыйПуть", Константы.БазовыйПутьAPIЭлемента.Получить());
	Настройки.Вставить("ПутьПолученияТокена", Константы.ПутьПолученияТокенаЭлемента.Получить());
	Настройки.Вставить("ИдентификаторКлиента", Константы.ИдентификаторКлиентаЭлемента.Получить());
	Настройки.Вставить("СекретКлиента", Константы.СекретКлиентаЭлемента.Получить());
	Настройки.Вставить("Таймаут", Константы.ТаймаутHTTPСекунды.Получить());
	Настройки.Вставить("МаксимумПопыток", Константы.МаксимумПопытокОбмена.Получить());
	Настройки.Вставить("БазоваяЗадержка", Константы.БазоваяЗадержкаПовтораСекунды.Получить());
	Настройки.Вставить("РазмерПакета", Константы.РазмерПакетаОбмена.Получить());

	Если Настройки.Порт = 0 Тогда
		Если Настройки.ИспользоватьHTTPS Тогда
			Настройки.Порт = 443;
		Иначе
			Настройки.Порт = 80;
		КонецЕсли;
	КонецЕсли;

	Если Настройки.Таймаут = 0 Тогда
		Настройки.Таймаут = 30;
	КонецЕсли;
	Если Настройки.МаксимумПопыток = 0 Тогда
		Настройки.МаксимумПопыток = 10;
	КонецЕсли;
	Если Настройки.БазоваяЗадержка = 0 Тогда
		Настройки.БазоваяЗадержка = 60;
	КонецЕсли;
	Если Настройки.РазмерПакета = 0 Тогда
		Настройки.РазмерПакета = 100;
	КонецЕсли;
	Если ПустаяСтрока(СокрЛП(Настройки.ПутьПолученияТокена)) Тогда
		Настройки.ПутьПолученияТокена = "/auth/oidc/token";
	КонецЕсли;

	Возврат Настройки;

КонецФункции

Функция ПолучитьТокенДоступаЭлемента(Настройки, ПринудительноОбновить = Ложь) Экспорт

	Если Не АвторизацияНастроена(Настройки) Тогда
		Возврат "";
	КонецЕсли;

	ТекущаяДата = ТекущаяДатаСеанса();
	Если Не ПринудительноОбновить
		И ТипЗнч(КэшТокенаДоступаЭлемента) = Тип("Строка")
		И Не ПустаяСтрока(КэшТокенаДоступаЭлемента)
		И ТипЗнч(ДействуетДоКэшТокенаЭлемента) = Тип("Дата")
		И ДействуетДоКэшТокенаЭлемента > ТекущаяДата Тогда
		Возврат КэшТокенаДоступаЭлемента;
	КонецЕсли;

	Соединение = СоздатьHTTPСоединениеЭлемента(Настройки);
	Запрос = Новый HTTPЗапрос(НормализоватьHTTPПуть(Настройки.ПутьПолученияТокена));
	Запрос.Заголовки.Вставить("Accept", "application/json");
	Запрос.Заголовки.Вставить("Client-Id", Настройки.ИдентификаторКлиента);
	Запрос.Заголовки.Вставить("Client-Secret", Настройки.СекретКлиента);

	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение СтрШаблон(
			"Сервис авторизации Элемента вернул HTTP %1.",
			Ответ.КодСостояния);
	КонецЕсли;

	ДанныеТокена = РазобратьОтветТокенаЭлемента(Ответ.ПолучитьТелоКакСтроку());
	КэшТокенаДоступаЭлемента = ДанныеТокена.Токен;
	ЗапасСекунд = 60;
	Если ДанныеТокена.СрокДействияСекунд <= 120 Тогда
		ЗапасСекунд = 5;
	КонецЕсли;
	СрокКэширования = ДанныеТокена.СрокДействияСекунд - ЗапасСекунд;
	Если СрокКэширования < 1 Тогда
		СрокКэширования = 1;
	КонецЕсли;
	ДействуетДоКэшТокенаЭлемента = ТекущаяДата + СрокКэширования;

	Возврат КэшТокенаДоступаЭлемента;

КонецФункции

Функция РазобратьОтветТокенаЭлемента(ТелоОтвета) Экспорт

	Если ПустаяСтрока(СокрЛП(Строка(ТелоОтвета))) Тогда
		ВызватьИсключение "Сервис авторизации Элемента вернул пустой ответ.";
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Попытка
		Чтение.УстановитьСтроку(Строка(ТелоОтвета));
		Данные = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
	Исключение
		ВызватьИсключение "Ответ сервиса авторизации Элемента не является корректным JSON.";
	КонецПопытки;

	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		ВызватьИсключение "Ответ сервиса авторизации Элемента должен быть объектом JSON.";
	КонецЕсли;

	Токен = Неопределено;
	Если Не Данные.Свойство("access_token", Токен)
		И Не Данные.Свойство("accessToken", Токен)
		И Не Данные.Свойство("token", Токен) Тогда
		ВызватьИсключение "Ответ сервиса авторизации Элемента не содержит access token.";
	КонецЕсли;
	Если ПустаяСтрока(СокрЛП(Строка(Токен))) Тогда
		ВызватьИсключение "Сервис авторизации Элемента вернул пустой access token.";
	КонецЕсли;

	СрокДействия = 300;
	ЗначениеСрока = Неопределено;
	Если Данные.Свойство("expires_in", ЗначениеСрока)
		Или Данные.Свойство("expiresIn", ЗначениеСрока) Тогда
		Попытка
			СрокДействия = Число(ЗначениеСрока);
		Исключение
			ВызватьИсключение "Поле срока действия токена должно содержать число секунд.";
		КонецПопытки;
	КонецЕсли;
	Если СрокДействия < 1 Тогда
		ВызватьИсключение "Срок действия токена должен быть положительным.";
	КонецЕсли;

	Возврат Новый Структура(
		"Токен, СрокДействияСекунд",
		Строка(Токен),
		СрокДействия);

КонецФункции

Процедура СброситьКэшТокенаДоступаЭлемента() Экспорт

	КэшТокенаДоступаЭлемента = Неопределено;
	ДействуетДоКэшТокенаЭлемента = Неопределено;

КонецПроцедуры

Функция ПроверитьАвторизациюЭлемента() Экспорт

	Настройки = ПолучитьНастройкиОбмена();
	СброситьКэшТокенаДоступаЭлемента();
	Токен = ПолучитьТокенДоступаЭлемента(Настройки, Истина);
	Если ПустаяСтрока(Токен) Тогда
		ВызватьИсключение "Не заполнены Client-Id и Client-Secret приложения Элемента.";
	КонецЕсли;
	Возврат Новый Структура(
		"Успешно, ДействуетДо",
		Не ПустаяСтрока(Токен),
		ДействуетДоКэшТокенаЭлемента);

КонецФункции

Функция АвторизацияНастроена(Настройки)

	ЕстьИдентификатор = Не ПустаяСтрока(СокрЛП(Строка(Настройки.ИдентификаторКлиента)));
	ЕстьСекрет = Не ПустаяСтрока(СокрЛП(Строка(Настройки.СекретКлиента)));
	Если ЕстьИдентификатор <> ЕстьСекрет Тогда
		ВызватьИсключение "Для авторизации Элемента необходимо заполнить одновременно Client-Id и Client-Secret.";
	КонецЕсли;

	Возврат ЕстьИдентификатор И ЕстьСекрет;

КонецФункции

Функция СоздатьHTTPСоединениеЭлемента(Настройки)

	ЗащищенноеСоединение = Неопределено;
	Если Настройки.ИспользоватьHTTPS Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	КонецЕсли;

	Возврат Новый HTTPСоединение(
		Настройки.Хост,
		Настройки.Порт,
		,
		,
		,
		Настройки.Таймаут,
		ЗащищенноеСоединение);

КонецФункции

Функция НормализоватьHTTPПуть(Путь)

	Путь = СокрЛП(Строка(Путь));
	Если ПустаяСтрока(Путь) Тогда
		Возврат "/";
	КонецЕсли;
	Если Лев(Путь, 1) <> "/" Тогда
		Путь = "/" + Путь;
	КонецЕсли;
	Возврат Путь;

КонецФункции

Процедура ОбработатьОчередьИсходящихСообщений() Экспорт

	Настройки = ПолучитьНастройкиОбмена();
	Если ПустаяСтрока(СокрЛП(Настройки.Хост)) Тогда
		ВызватьИсключение "Не настроен хост API 1С:Элемента.";
	КонецЕсли;

	СообщенияКОтправке = ПолучитьСообщенияКОтправке(
		ТекущаяДатаСеанса(),
		Настройки.РазмерПакета);

	Для Каждого Сообщение Из СообщенияКОтправке Цикл
		ОтправитьИсходящееСообщение(Сообщение, Настройки);
	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьИсходящееСообщение(Сообщение, Настройки)

	СообщениеОбъект = Сообщение.ПолучитьОбъект();
	СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийОбмена.ВОбработке;
	СообщениеОбъект.ДатаПоследнейПопытки = ТекущаяДатаСеанса();
	СообщениеОбъект.КоличествоПопыток = СообщениеОбъект.КоличествоПопыток + 1;
	СообщениеОбъект.ТекстОшибки = "";
	СообщениеОбъект.Записать();

	Попытка
		Соединение = СоздатьHTTPСоединениеЭлемента(Настройки);
		ТокенДоступа = ПолучитьТокенДоступаЭлемента(Настройки);

		Путь = СоединитьПути(
			Настройки.БазовыйПуть,
			ПолучитьПутьДляТипаСообщения(СообщениеОбъект.ТипСообщения));

		Запрос = Новый HTTPЗапрос(Путь);
		Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Запрос.Заголовки.Вставить(
			"X-Message-Id",
			Строка(СообщениеОбъект.ИдентификаторСообщения));
		Запрос.Заголовки.Вставить(
			"X-Entity-Id",
			Строка(СообщениеОбъект.ИдентификаторСущности));
		Запрос.Заголовки.Вставить(
			"X-Payload-Hash",
			СообщениеОбъект.ХэшПолезнойНагрузки);
		Запрос.Заголовки.Вставить(
			"X-Contract-Version",
			СообщениеОбъект.ВерсияКонтракта);

		Если Не ПустаяСтрока(ТокенДоступа) Тогда
			Запрос.Заголовки.Вставить(
				"Authorization",
				"Bearer " + ТокенДоступа);
		КонецЕсли;

		ТелоСообщения = СообщениеОбъект.ПолезнаяНагрузка.Получить();
		Запрос.УстановитьТелоИзСтроки(
			Строка(ТелоСообщения),
			КодировкаТекста.UTF8);

		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		Если Ответ.КодСостояния = 401 И Не ПустаяСтрока(ТокенДоступа) Тогда
			ТокенДоступа = ПолучитьТокенДоступаЭлемента(Настройки, Истина);
			Запрос.Заголовки.Вставить("Authorization", "Bearer " + ТокенДоступа);
			Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		КонецЕсли;
		СообщениеОбъект.КодHTTP = Ответ.КодСостояния;

		Если Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 300 Тогда
			СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийОбмена.Отправлено;
			СообщениеОбъект.ДатаОбработки = ТекущаяДатаСеанса();
			СообщениеОбъект.ТекстОшибки = "";
		Иначе
			ЗафиксироватьОшибкуОтправки(
				СообщениеОбъект,
				Настройки,
				СтрШаблон(
					"HTTP %1: %2",
					Ответ.КодСостояния,
					Ответ.ПолучитьТелоКакСтроку()));
		КонецЕсли;

	Исключение
		ЗафиксироватьОшибкуОтправки(
			СообщениеОбъект,
			Настройки,
			ОписаниеОшибки());
	КонецПопытки;

	СообщениеОбъект.Записать();

КонецПроцедуры

Процедура ЗафиксироватьОшибкуОтправки(СообщениеОбъект, Настройки, ТекстОшибки)

	СообщениеОбъект.ТекстОшибки = Лев(ТекстОшибки, 4000);

	Если СообщениеОбъект.КоличествоПопыток >= Настройки.МаксимумПопыток Тогда
		СообщениеОбъект.Статус =
			Перечисления.СтатусыСообщенийОбмена.НеобрабатываемаяОшибка;
	Иначе
		СообщениеОбъект.Статус =
			Перечисления.СтатусыСообщенийОбмена.ОжидаетПовтора;
		Задержка = Настройки.БазоваяЗадержка
			* СообщениеОбъект.КоличествоПопыток;
		СообщениеОбъект.ДатаСледующейПопытки =
			ТекущаяДатаСеанса() + Задержка;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПутьДляТипаСообщения(ТипСообщения)

	Если ТипСообщения = Перечисления.ТипыСообщенийОбмена.ПубликацияВерсииТеста Тогда
		Возврат "/test-versions";
	ИначеЕсли ТипСообщения = Перечисления.ТипыСообщенийОбмена.АрхивацияТеста Тогда
		Возврат "/test-archives";
	ИначеЕсли ТипСообщения = Перечисления.ТипыСообщенийОбмена.Подтверждение Тогда
		Возврат "/confirmations";
	ИначеЕсли ТипСообщения
		= Перечисления.ТипыСообщенийОбмена.РезультатРучнойПроверки Тогда
		Возврат "/manual-review-results";
	КонецЕсли;

	ВызватьИсключение "Для типа сообщения не настроен endpoint 1С:Элемента.";

КонецФункции

Функция СоединитьПути(БазовыйПуть, ОтносительныйПуть)

	БазовыйПуть = СокрЛП(БазовыйПуть);
	Если ПустаяСтрока(БазовыйПуть) Тогда
		Возврат ОтносительныйПуть;
	КонецЕсли;

	Если Прав(БазовыйПуть, 1) = "/" Тогда
		БазовыйПуть = Лев(БазовыйПуть, СтрДлина(БазовыйПуть) - 1);
	КонецЕсли;

	Если Лев(ОтносительныйПуть, 1) <> "/" Тогда
		ОтносительныйПуть = "/" + ОтносительныйПуть;
	КонецЕсли;

	Возврат БазовыйПуть + ОтносительныйПуть;

КонецФункции

Процедура ОбработатьОчередьВходящихСообщений() Экспорт

	Настройки = ПолучитьНастройкиОбмена();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ &РазмерПакета
	|	Сообщения.Ссылка КАК Сообщение,
	|	ЕСТЬNULL(Обработанные.ХэшСообщения, """") КАК ХэшОбработанного
	|ИЗ
	|	Справочник.СообщенияОбмена КАК Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбработанныеВходящиеСообщения КАК Обработанные
	|		ПО Сообщения.ИдентификаторСообщения = Обработанные.ИдентификаторСообщения
	|ГДЕ
	|	Сообщения.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияОбмена.Входящее)
	|	И Сообщения.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыСообщенийОбмена.Новое),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыСообщенийОбмена.ОжидаетПовтора))
	|	И Сообщения.ДатаСледующейПопытки <= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сообщения.ДатаСоздания";

	Запрос.УстановитьПараметр("РазмерПакета", Настройки.РазмерПакета);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработатьВходящееСообщение(
			Выборка.Сообщение,
			Настройки,
			Выборка.ХэшОбработанного);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьВходящееСообщение(
	Сообщение,
	Настройки,
	ХэшОбработанного)

	СообщениеОбъект = Сообщение.ПолучитьОбъект();
	СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийОбмена.ВОбработке;
	СообщениеОбъект.ДатаПоследнейПопытки = ТекущаяДатаСеанса();
	СообщениеОбъект.КоличествоПопыток = СообщениеОбъект.КоличествоПопыток + 1;
	СообщениеОбъект.Записать();

	Попытка
		Если Не ПустаяСтрока(ХэшОбработанного) Тогда
			Если ХэшОбработанного <> СообщениеОбъект.ХэшПолезнойНагрузки Тогда
				СообщениеОбъект.Статус =
					Перечисления.СтатусыСообщенийОбмена.Карантин;
				СообщениеОбъект.ТекстОшибки =
					"Коллизия messageId: обработанное сообщение имеет другой хэш.";
			Иначе
				СообщениеОбъект.Статус =
					Перечисления.СтатусыСообщенийОбмена.Обработано;
				СообщениеОбъект.ДатаОбработки = ТекущаяДатаСеанса();
			КонецЕсли;
			СообщениеОбъект.Записать();
			Возврат;
		КонецЕсли;

		Если СообщениеОбъект.ТипСообщения
			<> Перечисления.ТипыСообщенийОбмена.РезультатПопытки Тогда
			ВызватьИсключение "Получен неподдерживаемый тип входящего сообщения.";
		КонецЕсли;

		ТекстJSON = Строка(СообщениеОбъект.ПолезнаяНагрузка.Получить());

		НачатьТранзакцию();
		Попытка
			РезультатПопытки = СоздатьРезультатПопыткиИзJSON(
				ТекстJSON,
				СообщениеОбъект);

			ЗафиксироватьОбработанноеВходящееСообщениеБезПроверки(
				СообщениеОбъект.ИдентификаторСообщения,
				СообщениеОбъект.ХэшПолезнойНагрузки,
				СообщениеОбъект.ТипСообщения,
				РезультатПопытки);

			СообщениеОбъект.Статус =
				Перечисления.СтатусыСообщенийОбмена.Обработано;
			СообщениеОбъект.ДатаОбработки = ТекущаяДатаСеанса();
			СообщениеОбъект.ТекстОшибки = "";
			СообщениеОбъект.Записать();

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	Исключение
		СообщениеОбъект = Сообщение.ПолучитьОбъект();
		ЗафиксироватьОшибкуОбработкиВходящего(
			СообщениеОбъект,
			Настройки,
			ОписаниеОшибки());
		СообщениеОбъект.Записать();
	КонецПопытки;

КонецПроцедуры

Функция СоздатьРезультатПопыткиИзJSON(ТекстJSON, СообщениеОбъект)

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Данные = ПрочитатьJSON(Чтение);

	ИдентификаторПопытки = ПолучитьUUIDJSON(Данные, "attemptId");
	ИдентификаторНазначения = ПолучитьUUIDJSON(Данные, "assignmentId");
	РевизияРезультата = ПолучитьСвойствоJSON(Данные, "revision");

	ДанныеКандидата = ПолучитьСвойствоJSON(Данные, "candidate");
	ИдентификаторКандидата = ПолучитьUUIDJSON(ДанныеКандидата, "id");
	Кандидат = ПолучитьИлиСоздатьКандидата(ДанныеКандидата, ИдентификаторКандидата);

	ДанныеТеста = ПолучитьСвойствоJSON(Данные, "test");
	ИдентификаторТеста = ПолучитьUUIDJSON(ДанныеТеста, "id");
	ИдентификаторВерсии = ПолучитьUUIDJSON(ДанныеТеста, "versionId");
	Тест = НайтиТестПоИдентификатору(ИдентификаторТеста);
	ВерсияТеста = НайтиВерсиюПоИдентификатору(ИдентификаторВерсии);

	Если Не ЗначениеЗаполнено(Тест)
		Или Не ЗначениеЗаполнено(ВерсияТеста) Тогда
		ВызватьИсключение "Тест или опубликованная версия не найдены в 1С.";
	КонецЕсли;

	Если ВерсияТеста.Владелец <> Тест Тогда
		ВызватьИсключение "Указанная версия принадлежит другому тесту.";
	КонецЕсли;

	Документ = Документы.РезультатПопытки.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.ИдентификаторСообщения = СообщениеОбъект.ИдентификаторСообщения;
	Документ.ИдентификаторПопытки = ИдентификаторПопытки;
	Документ.РевизияРезультата = РевизияРезультата;
	Документ.ИдентификаторНазначения = ИдентификаторНазначения;
	Документ.Кандидат = Кандидат;
	Документ.ИмяКандидатаСнимок =
		ПолучитьСвойствоJSON(ДанныеКандидата, "displayName");
	Документ.Тест = Тест;
	Документ.ВерсияТеста = ВерсияТеста;
	Документ.ХэшВерсииТеста =
		ПолучитьСвойствоJSON(ДанныеТеста, "versionHash");
    Если ВерсияТеста.СтатусВерсии = Перечисления.СтатусыВерсийТестов.Черновик
        Или Документ.ХэшВерсииТеста <> ВерсияТеста.ХэшСодержимого Тогда
        ВызватьИсключение "Результат должен ссылаться на опубликованную версию с совпадающим хэшем.";
    КонецЕсли;
	Документ.ДатаНачала =
		ПолучитьДатуJSON(Данные, "startedAt");
	Документ.ДатаЗавершения =
		ПолучитьДатуJSON(Данные, "finishedAt");
	Документ.ДатаПолучения = ТекущаяДатаСеанса();
	Документ.СпособЗавершения =
		ПолучитьСпособЗавершения(
			ПолучитьСвойствоJSON(Данные, "completionMode"));
	Документ.ПроходнойБаллСнимок = ВерсияТеста.ПроходнойБаллПроцентов;
	Документ.ХэшИсходногоСообщения =
		СообщениеОбъект.ХэшПолезнойНагрузки;
	Документ.ИсходноеСообщение = Новый ХранилищеЗначения(ТекстJSON);

	ОтветыJSON = ПолучитьСвойствоJSON(Данные, "answers");
	Для Каждого ОтветJSON Из ОтветыJSON Цикл
		ЗаполнитьОтветИзJSON(Документ, ОтветJSON, ВерсияТеста);
	КонецЦикла;

    ВопросыВерсии = РабочееМестоТестированияСервер.СписокПодчиненных("ВопросыВерсийТестов", ВерсияТеста);
    Если Документ.Ответы.Количество() <> ВопросыВерсии.Количество() Тогда
        ВызватьИсключение "Результат должен содержать ответы на все вопросы версии, включая пропущенные.";
    КонецЕсли;
    УникальныеВопросы = Новый Соответствие;
    Для Каждого Ответ Из Документ.Ответы Цикл
        Если УникальныеВопросы.Получить(Ответ.ВопросВерсии) <> Неопределено Тогда
            ВызватьИсключение "Вопрос в результате повторяется.";
        КонецЕсли;
        УникальныеВопросы.Вставить(Ответ.ВопросВерсии, Истина);
    КонецЦикла;
	Документ.Записать();

	ЗарегистрироватьИдентификаторИнтеграции(
		"attempt",
		ИдентификаторПопытки,
		Документ.Ссылка);

	Возврат Документ.Ссылка;

КонецФункции

Процедура ЗаполнитьОтветИзJSON(Документ, ОтветJSON, ВерсияТеста)

	ИдентификаторОтвета = ПолучитьUUIDJSON(ОтветJSON, "answerId");
	ИдентификаторВопроса = ПолучитьUUIDJSON(ОтветJSON, "questionVersionId");
	Вопрос = НайтиВопросПоИдентификаторуВерсии(ИдентификаторВопроса);

	Если Не ЗначениеЗаполнено(Вопрос)
		Или Вопрос.Владелец <> ВерсияТеста Тогда
		ВызватьИсключение "Вопрос из результата не найден в опубликованной версии.";
	КонецЕсли;

	СтрокаОтвета = Документ.Ответы.Добавить();
	СтрокаОтвета.ИдентификаторОтвета = ИдентификаторОтвета;
	СтрокаОтвета.ПорядокВПопытке =
		ПолучитьСвойствоJSON(ОтветJSON, "order");
	СтрокаОтвета.ВопросВерсии = Вопрос;
	СтрокаОтвета.ТекстВопросаСнимок = Вопрос.ТекстВопроса;
	СтрокаОтвета.ТипОтветаСнимок = Вопрос.ТипОтвета;
	СтрокаОтвета.ТекстовыйОтвет =
		ПолучитьСвойствоJSON(ОтветJSON, "textAnswer", Ложь, "");
	СтрокаОтвета.ОтветДан =
		ПолучитьСвойствоJSON(ОтветJSON, "answered");
	СтрокаОтвета.СтатусПроверки =
		ПолучитьСтатусПроверкиОтвета(
			ПолучитьСвойствоJSON(ОтветJSON, "checkStatus"));
	СтрокаОтвета.ОтветПравильный =
		ПолучитьСвойствоJSON(ОтветJSON, "isCorrect", Ложь, Ложь);
	СтрокаОтвета.НабраноБаллов =
		ПолучитьСвойствоJSON(ОтветJSON, "awardedPoints");
	СтрокаОтвета.МаксимальныйБалл = Вопрос.МаксимальныйБалл;
	СтрокаОтвета.КомментарийПроверки =
		ПолучитьСвойствоJSON(ОтветJSON, "reviewComment", Ложь, "");

	ВариантыJSON =
		ПолучитьСвойствоJSON(ОтветJSON, "options", Ложь, Новый Массив);
	Для Каждого ВариантJSON Из ВариантыJSON Цикл
		ЗаполнитьВариантИзJSON(
			Документ,
			ВариантJSON,
			ИдентификаторОтвета,
			Вопрос);
	КонецЦикла;

    Выбранные = Новый Массив;
    Правильные = Новый Массив;
    Показанные = Новый Соответствие;
    Для Каждого ВариантJSON Из ВариантыJSON Цикл
        ID = ПолучитьUUIDJSON(ВариантJSON, "optionVersionId");
        Если Показанные.Получить(ID) <> Неопределено Тогда ВызватьИсключение "Вариант ответа повторяется."; КонецЕсли;
        Показанные.Вставить(ID, Истина);
        Если ПолучитьСвойствоJSON(ВариантJSON, "selected") Тогда Выбранные.Добавить(ID); КонецЕсли;
    КонецЦикла;
    ВариантыВерсии = Справочники.ВариантыОтветовВерсий.Выбрать(, Вопрос);
    ЧислоВариантов = 0;
    Пока ВариантыВерсии.Следующий() Цикл
        Если ВариантыВерсии.ПометкаУдаления Тогда Продолжить; КонецЕсли;
        ЧислоВариантов = ЧислоВариантов + 1;
        Если ВариантыВерсии.Правильный Тогда Правильные.Добавить(ВариантыВерсии.ИдентификаторВерсииВарианта); КонецЕсли;
    КонецЦикла;
    Если ЧислоВариантов <> Показанные.Количество() Тогда ВызватьИсключение "Неполный набор показанных вариантов."; КонецЕсли;
    Оценка = РасчетРезультатовТестовСервер.ОценитьОтвет(Вопрос, СтрокаОтвета.ТекстовыйОтвет, Выбранные, Правильные);
    ЗаполнитьЗначенияСвойств(СтрокаОтвета, Оценка);
    СтрокаОтвета.ОтветДан = Выбранные.Количество() > 0 Или Не ПустаяСтрока(СокрЛП(СтрокаОтвета.ТекстовыйОтвет));

КонецПроцедуры

Процедура ЗаполнитьВариантИзJSON(
	Документ,
	ВариантJSON,
	ИдентификаторОтвета,
	Вопрос)

	ИдентификаторВарианта =
		ПолучитьUUIDJSON(ВариантJSON, "optionVersionId");
	Вариант = НайтиВариантПоИдентификаторуВерсии(ИдентификаторВарианта);

	Если Не ЗначениеЗаполнено(Вариант)
		Или Вариант.Владелец <> Вопрос Тогда
		ВызватьИсключение "Вариант ответа не найден в опубликованном вопросе.";
	КонецЕсли;

	СтрокаВарианта = Документ.ВариантыОтветов.Добавить();
	СтрокаВарианта.ИдентификаторОтвета = ИдентификаторОтвета;
	СтрокаВарианта.ВариантОтветаВерсии = Вариант;
	СтрокаВарианта.ИдентификаторВерсииВарианта = ИдентификаторВарианта;
	СтрокаВарианта.ПорядокВПопытке =
		ПолучитьСвойствоJSON(ВариантJSON, "order");
	СтрокаВарианта.ТекстВариантаСнимок = Вариант.ТекстВарианта;
	СтрокаВарианта.Выбран =
		ПолучитьСвойствоJSON(ВариантJSON, "selected");

КонецПроцедуры

Функция ПолучитьИлиСоздатьКандидата(ДанныеКандидата, ИдентификаторКандидата)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кандидаты.Ссылка КАК Кандидат
	|ИЗ
	|	Справочник.КандидатыВнешние КАК Кандидаты
	|ГДЕ
	|	Кандидаты.ИдентификаторКандидата = &ИдентификаторКандидата";
	Запрос.УстановитьПараметр(
		"ИдентификаторКандидата",
		ИдентификаторКандидата);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Кандидат = Выборка.Кандидат.ПолучитьОбъект();
	Иначе
		Кандидат = Справочники.КандидатыВнешние.СоздатьЭлемент();
		Кандидат.ИдентификаторКандидата = ИдентификаторКандидата;
	КонецЕсли;

	Кандидат.ОтображаемоеИмя =
		ПолучитьСвойствоJSON(ДанныеКандидата, "displayName");
	Кандидат.Наименование = Лев(Кандидат.ОтображаемоеИмя, 150);
	Кандидат.Email =
		ПолучитьСвойствоJSON(ДанныеКандидата, "email", Ложь, "");
	Кандидат.Активен = Истина;
	Кандидат.РевизияЭлемент =
		ПолучитьСвойствоJSON(ДанныеКандидата, "revision", Ложь, 0);
	Кандидат.Записать();

	ЗарегистрироватьИдентификаторИнтеграции(
		"candidate",
		ИдентификаторКандидата,
		Кандидат.Ссылка);

	Возврат Кандидат.Ссылка;

КонецФункции

Функция НайтиТестПоИдентификатору(Идентификатор)

	Возврат НайтиСсылкуПоИдентификатору(
		"Тесты",
		"ИдентификаторТеста",
		Идентификатор);

КонецФункции

Функция НайтиВерсиюПоИдентификатору(Идентификатор)

	Возврат НайтиСсылкуПоИдентификатору(
		"ВерсииТестов",
		"ИдентификаторВерсии",
		Идентификатор);

КонецФункции

Функция НайтиВопросПоИдентификаторуВерсии(Идентификатор)

	Возврат НайтиСсылкуПоИдентификатору(
		"ВопросыВерсийТестов",
		"ИдентификаторВерсииВопроса",
		Идентификатор);

КонецФункции

Функция НайтиВариантПоИдентификаторуВерсии(Идентификатор)

	Возврат НайтиСсылкуПоИдентификатору(
		"ВариантыОтветовВерсий",
		"ИдентификаторВерсииВарианта",
		Идентификатор);

КонецФункции

Функция НайтиСсылкуПоИдентификатору(ИмяСправочника, ИмяРеквизита, Идентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Данные.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.%1 КАК Данные
		|ГДЕ
		|	Данные.%2 = &Идентификатор",
		ИмяСправочника,
		ИмяРеквизита);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПолучитьСвойствоJSON(
	ОбъектJSON,
	ИмяСвойства,
	Обязательное = Истина,
	ЗначениеПоУмолчанию = Неопределено)

	Значение = ЗначениеПоУмолчанию;
	Если Не ОбъектJSON.Свойство(ИмяСвойства, Значение) Тогда
		Если Обязательное Тогда
			ВызватьИсключение СтрШаблон(
				"В JSON отсутствует обязательное свойство '%1'.",
				ИмяСвойства);
		КонецЕсли;
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Возврат Значение;

КонецФункции

Функция ПолучитьUUIDJSON(ОбъектJSON, ИмяСвойства)

	Значение = ПолучитьСвойствоJSON(ОбъектJSON, ИмяСвойства);
	Попытка
		Возврат Новый УникальныйИдентификатор(Строка(Значение));
	Исключение
		ВызватьИсключение СтрШаблон(
			"Свойство '%1' должно содержать UUID.",
			ИмяСвойства);
	КонецПопытки;

КонецФункции

Функция ПолучитьДатуJSON(ОбъектJSON, ИмяСвойства)

	Значение = ПолучитьСвойствоJSON(ОбъектJSON, ИмяСвойства);
	Попытка
		Возврат XMLЗначение(Тип("Дата"), Строка(Значение));
	Исключение
		ВызватьИсключение СтрШаблон(
			"Свойство '%1' должно содержать дату ISO 8601.",
			ИмяСвойства);
	КонецПопытки;

КонецФункции

Функция ПолучитьСпособЗавершения(Код)

	Если Код = "candidate" Тогда
		Возврат Перечисления.СпособыЗавершенияПопытки.Кандидатом;
	ИначеЕсли Код = "timeout" Тогда
		Возврат Перечисления.СпособыЗавершенияПопытки.ПоИстеченииВремени;
	ИначеЕсли Код = "system" Тогда
		Возврат Перечисления.СпособыЗавершенияПопытки.Системой;
	КонецЕсли;

	ВызватьИсключение "Неподдерживаемый completionMode.";

КонецФункции

Функция ПолучитьСтатусПроверкиОтвета(Код)

	Если Код = "correct" Тогда
		Возврат Перечисления.СтатусыПроверкиОтвета.Правильный;
	ИначеЕсли Код = "incorrect" Тогда
		Возврат Перечисления.СтатусыПроверкиОтвета.Неправильный;
	ИначеЕсли Код = "manualReview" Тогда
		Возврат Перечисления.СтатусыПроверкиОтвета.ОжидаетРучнойПроверки;
	ИначеЕсли Код = "unchecked" Тогда
		Возврат Перечисления.СтатусыПроверкиОтвета.НеПроверен;
	КонецЕсли;

	ВызватьИсключение "Неподдерживаемый checkStatus.";

КонецФункции

Процедура ЗафиксироватьОшибкуОбработкиВходящего(
	СообщениеОбъект,
	Настройки,
	ТекстОшибки)

	СообщениеОбъект.ТекстОшибки = Лев(ТекстОшибки, 4000);

	Если СообщениеОбъект.КоличествоПопыток >= Настройки.МаксимумПопыток Тогда
		СообщениеОбъект.Статус =
			Перечисления.СтатусыСообщенийОбмена.Карантин;
	Иначе
		СообщениеОбъект.Статус =
			Перечисления.СтатусыСообщенийОбмена.ОжидаетПовтора;
		СообщениеОбъект.ДатаСледующейПопытки =
			ТекущаяДатаСеанса()
			+ Настройки.БазоваяЗадержка
				* СообщениеОбъект.КоличествоПопыток;
	КонецЕсли;

КонецПроцедуры

Функция ВычислитьХэшПолезнойНагрузки(ПолезнаяНагрузка) Экспорт

	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(
		Строка(ПолезнаяНагрузка),
		КодировкаТекста.UTF8);

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ДвоичныеДанные);

	Возврат Base64Строка(Хеширование.ХешСумма);

КонецФункции

#КонецОбласти
